tutorials/CFD/19UnsteadyNSExplicit_turb_caso9/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.5;

// functions
// {

//     #includeFunc "solverInfo"


//     myFunctionObject
//     {
//         type            fieldAverage;
//         libs            ("libfieldFunctionObjects.so");
//         writeControl    timeStep;
//         writeInterval   1;
//         fields
//         (
//             U
//             {
//                 mean        on;
//                 prime2Mean  on;
//                 base        time;
//             }

//             p
//             {
//                 mean        on;
//                 prime2Mean  on;
//                 base        time;
//             }
//         );
//     }
// }

// ************************************************************************* //

